app/Observers/UserActionsObserver.php

insert into `user_actions` (`user_id`, `action`, `action_model`, `action_id`, `record_original`, `record_update`, `updated_at`, `created_at`) values (1, 'updated', 'payment_gateways', 1, '{\"id\":1,\"key\":\"stripe\",\"name\":\"Stripe\",\"description\":\"Stripe Settings\",\"logo\":null,\"created_at\":\"2019-02-22T08:45:49.000000Z\",\"updated_at\":\"2019-04-13T05:36:45.000000Z\",\"deleted_at\":null,\"status\":\"Active\"}', '{\"id\":1,\"key\":\"stripe\",\"name\":\"Stripe\",\"description\":\"Stripe Settings\",\"logo\":null,\"created_at\":\"2019-02-22 08:45:49\",\"updated_at\":\"2019-04-13 05:36:45\",\"deleted_at\":null,\"status\":\"Active\"}', '2025-05-21 07:26:54', '2025-05-21 07:26:54')
select * from `contacts` where `contacts`.`id` = 2 and `contacts`.`deleted_at` is null order by `contacts`.`id` desc limit 1
---
    public function saved($model)
    {
        if ($model->wasRecentlyCreated == true) {
            // Data was just created
            $action = 'created';
        } else {
            // Data was updated
            $action = 'updated';
        }
        if (Auth::check()) {
            UserAction::create([
                'user_id'      => Auth::user()->id,
                'action'       => $action,
                'action_model' => $model->getTable(),
                'action_id'    => $model->id,

                'record_original'    => json_encode( $model->getOriginal() ),
                'record_update'    => json_encode( $model->getAttributes() ),
            ]);

            if ( 'contacts' === $model->getTable() ) {
                $enable_mailchimp = getSetting('enable_mailchimp', 'mailchimp-settings', 'no');
                $api_key = trim( getSetting('mailchimp_api_key', 'mailchimp-settings', '') );
                $contact = \App\Models\Contact::find( $model->id );