app/helpers.php

select * from `contacts` where `id` = 2 and `contacts`.`deleted_at` is null order by `contacts`.`id` desc limit 1
---
function getDefaultCurrency( $type = 'symbol', $customer_id = '' ) {

  if ( ! isAdmin() && ! isExecutive() ) {
    $customer_id = Auth::id();
  }
  $symbol = getLocalSetting('default_currency', 'symbol');
  $display_currency = App\Models\Settings::getSetting('display_currency', 'currency_settings', 'symbol');
  if( 'id' === $type ) {
    $symbol = getLocalSetting('default_currency', 'id', DEFAULT_CURRENCY_ID);
  } elseif ( ( 'code' === $display_currency ) || ( 'code' === $type ) ) {
    $symbol = getLocalSetting('default_currency', 'code', '$');
  }

  if ( ! empty( $customer_id ) ) {
    $contact = \App\Models\Contact::where( 'id', $customer_id)->first();

select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = 2
---
function isAdmin( $id = '', $type = 'user' ) {
  $roles = Auth::user()->role()->get();

select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = 2
---
function isExecutive( $id = '', $type = 'user' ) {
  $roles = Auth::user()->role()->get();

select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = 2
---
function isCustomer( $id = '', $type = 'user' ) {
  $roles = Auth::user()->role()->get();

select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = 2
---
function isSalesPerson( $id = '', $type = 'user' ) {
  $roles = Auth::user()->role()->get();

select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = 1
---
function isProjectManager( $id = '', $type = 'user' ) {
  $roles = Auth::user()->role()->get();

select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = 1
---
function isClient( $id = '', $type = 'user' ) {
  $roles = Auth::user()->role()->get();

select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = 1
---
function isEmployee( $id = '', $type = 'user' ) {
  $roles = Auth::user()->role()->get();

select * from `countries` where `countries`.`id` = '1' and `countries`.`deleted_at` is null order by `countries`.`id` desc limit 1
---
function getCountryname( $country_id ) {
  $name = \App\Models\Country::find( $country_id );

select count(*) as aggregate from `invoice_payments` inner join `invoices` on `invoices`.`id` = `invoice_payments`.`invoice_id` where `payment_status` = 'success' and `invoices`.`customer_id` = 2
select count(*) as aggregate from `purchase_orders_payments` inner join `purchase_orders` on `purchase_orders`.`id` = `purchase_orders_payments`.`purchase_order_id` where `payment_status` = 'Success' and `purchase_orders`.`customer_id` = 2
select count(*) as aggregate from `orders_payments` inner join `orders` on `orders`.`id` = `orders_payments`.`order_id` where `payment_status` = 'success' and `orders`.`customer_id` = 2
select count(*) as aggregate from `credit_note_payments` inner join `credit_notes` on `credit_notes`.`id` = `credit_note_payments`.`credit_note_id` where `payment_status` = 'success' and `credit_notes`.`customer_id` = 2
select count(*) as aggregate from `credit_note_credits` inner join `credit_notes` on `credit_notes`.`id` = `credit_note_credits`.`credit_note_id` inner join `invoices` on `invoices`.`id` = `credit_note_credits`.`invoice_id` where `invoices`.`customer_id` = 2
---
function haveTransactions( $contact_id ) {
  $invoice_payments = DB::table('invoice_payments')->join('invoices', 'invoices.id', '=', 'invoice_payments.invoice_id')->where('payment_status', 'success')->where('invoices.customer_id', $contact_id)->count(); // Invoices and Recurring Invoices

  $purchase_order_payments =  DB::table('purchase_orders_payments')->join('purchase_orders', 'purchase_orders.id', '=', 'purchase_orders_payments.purchase_order_id')->where('payment_status', 'Success')->where('purchase_orders.customer_id', $contact_id)->count();

  $order_payments = DB::table('orders_payments')->join('orders', 'orders.id', '=', 'orders_payments.order_id')->where('payment_status', 'success')->where('orders.customer_id', $contact_id)->count();

  $credit_note_payments = DB::table('credit_note_payments')->join('credit_notes', 'credit_notes.id', '=', 'credit_note_payments.credit_note_id')->where('payment_status', 'success')->where('credit_notes.customer_id', $contact_id)->count();

  $credit_note_used = DB::table('credit_note_credits')
    ->join('credit_notes', 'credit_notes.id', '=', 'credit_note_credits.credit_note_id')
    ->join('invoices', 'invoices.id', '=', 'credit_note_credits.invoice_id')
    ->where('invoices.customer_id', $contact_id)->count();

select `code`, `language`, `is_rtl` from `languages` where `languages`.`deleted_at` is null order by `languages`.`id` desc
---
function updateLanguages()
{
  $session_languages = \App\Models\Language::select(['code', 'language', 'is_rtl'])->get()->toArray();

select * from `modules_managements` where `enabled` = 'Yes' and `slug` = 'sendsms' and `modules_managements`.`deleted_at` is null limit 1
---
function isPluginActive( $slug )
{

  if ( config('app.db_database') == '' ) {
    return false;
  }
  if ( config('app.db_database') == '' ) {
    return false;
  }
  $session_plugins = (array) json_decode(session('plugins'));

  if ( empty( $session_plugins ) ) {
    $session_plugins = updatePlugins();
  }

  if ( is_array( $slug ) ) {
    foreach( $slug as $p ) {
      if ( ! empty( $session_plugins[ $p ] ) ) {
        return true;
      }
    }
  } elseif ( ! empty( $session_plugins[ $slug ] ) ) {
      return true;
  } else {
      $plugin = \Modules\ModulesManagement\Entities\ModulesManagement::where('enabled', 'Yes')->where('slug', $slug)->first();

select * from `contacts` where `id` = 1 and `contacts`.`deleted_at` is null order by `contacts`.`id` desc limit 1
select * from `currencies` where `status` = 'Active' and `currencies`.`deleted_at` is null and `currencies`.`status` = 'Active' order by `currencies`.`id` desc
---
function updateLocalSettings( $module = '' )
{
  $default_currency = $user_currency = App\Models\Currency::where('is_default', 'yes')->first();
  if ( ! $default_currency ) {
    $default_currency = $user_currency = App\Models\Currency::where('id', DEFAULT_CURRENCY_ID)->first();
  }
  $default_currency = $default_currency->toArray();
  $contact = \App\Models\Contact::where( 'id', Auth::id())->first();
  if ( $contact && $contact->currency ) {
      $user_currency = $contact->currency->toArray();
  }
  $options = App\Models\Option::get()->pluck('name', 'value')->toArray();

  $currencies = App\Models\Currency::where('status', 'Active')->get();

select `slug`, `type` from `modules_managements` where `enabled` = 'Yes' and `modules_managements`.`deleted_at` is null
---
function updatePlugins()
{
  $session_plugins = \Modules\ModulesManagement\Entities\ModulesManagement::select(['slug', 'type'])->where('enabled', 'Yes')->get()->pluck('type', 'slug')->toArray();