app/Http/Controllers/HomeController.php

    public function dashboard()
    {

        if ( isCustomer() ) {
            $customer_id = Auth::user()->id;
            $invoices = \App\Models\Invoice::withoutGlobalScopes(['is_recurring'])->where('customer_id',  $customer_id)->where('status',  'Published')->latest()->limit(5)->get();
            $quotes = \Modules\Quotes\Entities\Quote::where('customer_id',  $customer_id)->where('status', 'Published')->latest()->limit(5)->get();
            $orders = \Modules\Orders\Entities\Order::where('customer_id',  $customer_id)->latest()->limit(5)->get();

            $widgets = \App\Models\DashBoard::select('dashboard_widgets.*', 'dwr.display_columns as columns')->join('dashboard_widgets_role as dwr', 'dwr.dash_board_id', '=', 'dashboard_widgets.id')->where('dwr.role_id', CUSTOMERS_TYPE)->where('status', 'active')->orderBy('dwr.display_order')->get();

            return view('home-customer', compact( 'invoices', 'quotes', 'orders', 'widgets' ));
        } else {
            $widgets = '';
            $widgets_arr = [];
            $role_id = '';
            $roles = Auth::User()->role;
            if ( ! empty( $roles ) ) {
                $priority = $priority_old = 0;
                foreach ($roles as $role ) {
                    if ( $role->priority >= $priority_old ) {
                        $role_id = $role->id;
                    } elseif ( $roles->count() == 1 ) {
                        $role_id = $role->id;
                    }
                    $priority_old = $role->priority;
                }
            }
            if ( ! empty( $role_id ) ) {
                $widgets = \App\Models\DashBoard::select('dashboard_widgets.*', 'dwr.display_columns as columns')->join('dashboard_widgets_role as dwr', 'dwr.dash_board_id', '=', 'dashboard_widgets.id')->where('dwr.role_id', $role_id)->where('status', 'active')->orderBy('dwr.display_order')->get();
---
select `dashboard_widgets`.*, `dwr`.`display_columns` as `columns` from `dashboard_widgets` inner join `dashboard_widgets_role` as `dwr` on `dwr`.`dash_board_id` = `dashboard_widgets`.`id` where `dwr`.`role_id` = 3 and `status` = 'active' order by `dwr`.`display_order` asc

            }

            if ( in_array( 'income-amount', $widgets_arr ) ) {
                $incomes = \App\Models\Income::latest()->limit(5)->get();
            }
            if ( in_array( 'expenses', $widgets_arr ) || in_array( 'recent-expenses', $widgets_arr )) {
                $expenses = \App\Models\Expense::latest()->limit(5)->get();
---
select * from `incomes` order by `created_at` desc, `incomes`.`id` desc limit 5
select * from `expenses` order by `created_at` desc, `expenses`.`id` desc limit 5

                $yearly_data['areachart_invoices'][ $year ] = $labels_invoices;
            }

            $income = \App\Models\Income::with(['income_category'])->join('income_categories', 'income_categories.id', '=', 'incomes.income_category_id')->get()->sortBy('entry_date')->groupBy(function ($entry) {
                    return $entry->income_category->name;
                        })->map(function ($entries, $group) {
                return number_format( $entries->sum('amount'), 2, '.', '' );
            });
            $yearly_data['income'] = $income;

            $expenses_chart = \App\Models\Expense::with(['expense_category'])->join('expense_categories', 'expense_categories.id', '=', 'expenses.expense_category_id')->get()->sortBy('entry_date')->groupBy(function ($entry) {
                    return $entry->expense_category->name;
                        })->map(function ($entries, $group) {
                return number_format( $entries->sum('amount'), 2, '.', '' );
            });
---
select * from `incomes` inner join `income_categories` on `income_categories`.`id` = `incomes`.`income_category_id` order by `incomes`.`id` desc
select * from `expenses` inner join `expense_categories` on `expense_categories`.`id` = `expenses`.`expense_category_id` order by `expenses`.`id` desc

                return $entry->title;
            })->map(function ($entries, $group) {
                return $entries->sum(function ($entry) {
                    return \App\Models\Contact::join('contact_contact_type', 'contact_contact_type.contact_id', 'contacts.id')->join('roles', 'roles.id', 'contact_contact_type.contact_type_id')->where('contact_type_id', $entry->id)->count('contacts.id');
---
select count(`contacts`.`id`) as aggregate from `contacts` inner join `contact_contact_type` on `contact_contact_type`.`contact_id` = `contacts`.`id` inner join `roles` on `roles`.`id` = `contact_contact_type`.`contact_type_id` where `contact_type_id` = 14 and `contacts`.`deleted_at` is null

            $today = Carbon::today();
            $date_to = $to = date("Y-m-t", strtotime($today));

            $income_monthwise = \App\Models\Income::whereBetween('entry_date', [$from, $to])->get()->sortBy('entry_date')->groupBy(function ($entry) {
                if ($entry->entry_date instanceof Carbon) {
                    return Carbon::parse($entry->entry_date)->format('M');
                }
                try {
                   return Carbon::createFromFormat(config('app.date_format'), $entry->entry_date)->format('M');
                } catch (\Exception $e) {
                     return Carbon::createFromFormat(config('app.date_format') . ' H:i:s', $entry->entry_date)->format('M');
                }        })->map(function ($entries, $group) {
                return number_format( $entries->sum('amount'), 2, '.', '' );
            });
---
select * from `incomes` where `entry_date` between '2024-05-31' and '2025-05-31' order by `incomes`.`id` desc