app/Providers/AuthServiceProvider.php

    public function boot()
    {

        $this->registerPolicies();

        // Passport::routes();

        Passport::tokensExpireIn(now()->addDays(15));
        Passport::refreshTokensExpireIn(now()->addDays(30));
        if( config('app.db_database') != '' ) {

        $user = \Auth::user();

        $permissionArray=[];
        if ( ! app()->runningInConsole() ) {
            $roles = Role::with('permission')->get();

            foreach ($roles as $role) {
                foreach ($role->permission as $permission) {

                    $permissionArray[$permission->title][] = $role->id;
                }
            }

            foreach ($permissionArray as $title => $roles) {

                Gate::define($title, function (User $user) use ($roles) {

                    return count(array_intersect($user->role->pluck('id')->toArray(), $roles));
---
select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = 1