app/Http/Controllers/Admin/ContactGroupsController.php

    public function store(Request $request)
    {
        if (! Gate::allows('contact_group_create')) {
            return prepareBlockUserMessage();
        }

        $rules = [
            'name' => 'required|unique:contact_groups,name',
        ];
        $validator = Validator::make($request->all(), $rules);
        if ( ! $validator->passes() ) {
            if ( $request->ajax() ) {
                return response()->json(['error'=>$validator->errors()->all()]);
            } else {
                return redirect()->back()->withErrors($validator)->withInput();
            }
        }

        if ( isDemo() ) {
         return prepareBlockUserMessage( 'info', 'crud_disabled' );
        }

        $contact_group = ContactGroup::create($request->all());
---
insert into `contact_groups` (`name`, `description`, `updated_at`, `created_at`) values ('flexora', null, '2025-05-21 06:01:46', '2025-05-21 06:01:46')