app/Http/Controllers/Admin/ContactsController.php

         if ( isDemo() ) {
         return prepareBlockUserMessage( 'info', 'crud_disabled' );
        }
        $contact = Contact::create($request->all());
        $contact->contact_type()->sync(array_filter((array)$request->input('contact_type')));
        $contact->language()->sync(array_filter((array)$request->input('language')));
---
insert into `contacts` (`first_name`, `last_name`, `email`, `currency_id`, `company_id`, `group_id`, `phone1_code`, `phone1`, `phone2_code`, `phone2`, `skype`, `tax_id`, `address`, `city`, `state_region`, `zip_postal_code`, `country_id`, `thumbnail`, `updated_at`, `created_at`) values ('Flexora', 'Printing & Advertising', 'flexora27@gmail.com', '1', '1', '1', '+91', '8140349306', null, null, null, null, '5/6, First Floor, Shraddha Raw House, Nr. Community Hall, Sarthana Jakat Naka, Surat.', 'SURAT', 'GJ', '395010', '1', '1747807346-Logo.jpg', '2025-05-21 06:02:26', '2025-05-21 06:02:26')
insert into `contact_contact_type` (`contact_id`, `contact_type_id`) values (2, 2)
insert into `contact_language` (`contact_id`, `language_id`) values (2, 1)

    public function edit($id)
    {
        if (! Gate::allows('contact_edit')) {
            return prepareBlockUserMessage();
        }

        $companies = \App\Models\ContactCompany::get()->pluck('name', 'id')->prepend(trans('global.app_please_select'), '');
        $groups = \App\Models\ContactGroup::get()->pluck('name', 'id')->prepend(trans('global.app_please_select'), '');
        $contact_types = \App\Models\ContactType::orderBy('title')->get()->pluck('title', 'id');

        $languages = \App\Models\Language::get()->pluck('language', 'id');

        $countries = \App\Models\Country::get()->pluck('title', 'id')->prepend(trans('global.app_please_select'), '');

        $contact = Contact::findOrFail($id);
---
select * from `contacts` where `contacts`.`id` = '2' and `contacts`.`deleted_at` is null order by `contacts`.`id` desc limit 1