app/Http/Controllers/Admin/ContactCompaniesController.php

    public function store(Request  $request)
    {
        if (! Gate::allows('contact_company_create')) {
            return prepareBlockUserMessage();
        }

        $rules = [
            'name' => 'required|unique:contact_companies,name',
            'email' => 'nullable|email|unique:contact_companies,email',
        ];

        $validator = Validator::make($request->all(), $rules);
        if ( ! $validator->passes() ) {
            if ( $request->ajax() ) {
                return response()->json(['error'=>$validator->errors()->all()]);
            } else {
                return redirect()->back()->withErrors($validator)->withInput();
            }
        }
        if ( isDemo() ) {
         return prepareBlockUserMessage( 'info', 'crud_disabled' );
        }
        $contact_company = ContactCompany::create($request->all());
---
insert into `contact_companies` (`name`, `email`, `country_id`, `website`, `address`, `updated_at`, `created_at`) values ('Flexora', 'flexora27@gmail.com', '1', null, '5/6, First Floor, Shraddha Raw House, Nr. Community Hall, Sarthana Jakat Naka, Surat.', '2025-05-21 06:01:38', '2025-05-21 06:01:38')