app/Http/Controllers/Admin/CurrenciesController.php

update `currencies` set `is_default` = 'no', `currencies`.`updated_at` = '2025-05-21 05:58:12' where `id` = 1
update `currencies` set `name` = 'indian rupee', `symbol` = '₹', `code` = 'INR', `is_default` = 'yes', `currencies`.`updated_at` = '2025-05-21 06:00:32' where `id` = 1
---
    public function update(UpdateCurrenciesRequest $request, $id)
    {
        if (! Gate::allows('currency_edit')) {
            return prepareBlockUserMessage();
        }

        $is_default = $request->is_default;
        if ( 'yes' === $is_default ) {
            $currencies = Currency::all();
            foreach ($currencies as $currency) {
               $currency->update(array( 'is_default' => 'no'));
            }

            $addtional = array(
                'rate' => 1,
            );
            $request->request->add( $addtional ); //add additonal / Changed values to the request object.
        }

        $currency = Currency::findOrFail($id);
        if ( isDemo() ) {
         return prepareBlockUserMessage( 'info', 'crud_disabled' );
        }
        $currency->update($request->all());