app/Http/Controllers/Admin/DepartmentsController.php

    public function store(Request $request)
    {
        if (! Gate::allows('department_create')) {
            return prepareBlockUserMessage();
        }
        $rules = [
            'name' => 'required|unique:departments,name',
        ];
        $validator = Validator::make($request->all(), $rules);
        if ( ! $validator->passes() ) {
            if ( $request->ajax() ) {
                return response()->json(['error'=>$validator->errors()->all()]);
            } else {
                return redirect()->back()->withErrors($validator)->withInput();
            }
        }

        if ( isDemo() ) {
         return prepareBlockUserMessage( 'info', 'crud_disabled' );
        }
        $department = Department::create($request->all());
---
insert into `departments` (`name`, `description`, `created_by_id`, `updated_at`, `created_at`) values ('Flexora Printing & Advertising', null, 1, '2025-05-21 06:03:04', '2025-05-21 06:03:04')