app/Http/Controllers/Admin/GeneralSettingsController.php

select * from `payment_gateways` where (`key` = 'stripe') and `payment_gateways`.`deleted_at` is null order by `payment_gateways`.`id` desc limit 1
---
    public function savePaymentGateway() {

		$payment_gateways = \App\Models\Settings::where('moduletype', 'payment')->get();
        if ( ! empty( $payment_gateways ) ) {
            foreach ($payment_gateways as $payment_gateway) {
               $gateway = \App\Models\PaymentGateway::firstOrNew( ['key' => $payment_gateway->key ] );