app/Http/Controllers/Admin/InstallatationController.php

    public function registerUser(Request $request)
    {


        if ( $request->isMethod('post') ) {
          $columns = array(
              'first_name' => 'required',
              'last_name' => 'required',
              'owner_email' => 'required|email|unique:contacts,email',
              'owner_password' => 'required|min:6',
          );
         $this->validate($request,$columns);

          // Everything is fine, create user to the system and redirect to login page
          $contact           = \App\Models\Contact::where('email', $request->owner_email)->first();
---
select * from `contacts` where `email` = 'kishanpolara139@gmail.com' and `contacts`.`deleted_at` is null order by `contacts`.`id` desc limit 1

            $user->ticket_emails = 1;

            $user->save();
            $user->role()->sync([ADMIN_TYPE]);
---
insert into `role_user` (`role_id`, `user_id`) values (1, 1)