app/Http/Controllers/Admin/ProductsReturnsController.php

                   function ($query) {
                       $query->where('id', CUSTOMERS_TYPE);
                   })->get()->pluck('name', 'id')->toArray();
                echo json_encode( $customers );
            break;
            case 'customer':
                    $customer_id = $request->customer_id;
                    $customer = \App\Models\Contact::where( 'id', $customer_id)->first();
---
select * from `contacts` where `id` = '4' and `contacts`.`deleted_at` is null order by `contacts`.`id` desc limit 1