app/Http/Controllers/Admin/UsersController.php

    public function create( $contact_id )
    {

        if (! Gate::allows('user_create')) {
            return prepareBlockUserMessage();
        }

        $contact = \App\Models\Contact::find( $contact_id );
---
select * from `contacts` where `contacts`.`id` = '2' and `contacts`.`deleted_at` is null order by `contacts`.`id` desc limit 1

        $request->request->add( $addtional ); //add additonal / Changed values to the request object.

        $id = $contact_id;
        $user = \App\Models\Contact::find($id);
---
select * from `contacts` where `contacts`.`id` = '2' and `contacts`.`deleted_at` is null order by `contacts`.`id` desc limit 1

            }
            $user->update($request->all());

            $user->role()->sync(array_filter((array)$request->input('role')));
---
insert into `role_user` (`role_id`, `user_id`) values (3, 2)